In [1]:
import sqlite3
engine = sqlite3.connect('example20.db')

In [2]:
cursor = engine.cursor()
cursor.execute("PRAGMA foreign_keys").fetchall()

[(0,)]

In [3]:
sql_create_projects_table = """ CREATE TABLE IF NOT EXISTS projects (
                                        id integer PRIMARY KEY,
                                        name text NOT NULL,
                                        begin_date text,
                                        end_date text
                                    ); """

In [4]:
sql_create_tasks_table = """CREATE TABLE IF NOT EXISTS tasks (
                                    id integer PRIMARY KEY,
                                    name text NOT NULL,
                                    priority integer,
                                    status_id integer NOT NULL,
                                    project_id integer NOT NULL REFERENCES projects (id),
                                    begin_date text NOT NULL,
                                    end_date text NOT NULL
                                );"""
# StudentId INT REFERENCES Student (StudentId)
#FOREIGN KEY (project_id) REFERENCES projects (id)

In [5]:
cursor.execute(sql_create_projects_table)

In [6]:
cursor.execute(sql_create_tasks_table)

In [7]:
data = cursor.execute("PRAGMA table_info(projects)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 id integer
1 name text
2 begin_date text
3 end_date text

In [8]:
data = cursor.execute("PRAGMA table_info(tasks)").fetchall()
for d in data:
    print (d[0], d[1],d[2])

0 id integer
1 name text
2 priority integer
3 status_id integer
4 project_id integer
5 begin_date text
6 end_date text

In [9]:
cursor.execute("INSERT INTO projects (name,begin_date,end_date) VALUES ('Project03','2021-02-23','2021-03-23')")

In [10]:
engine.commit()

In [11]:
cursor.execute('SELECT * FROM projects ').fetchall()

[(1, 'Project03', '2021-02-23', '2021-03-23')]

In [12]:
cursor.execute("INSERT INTO tasks (name,priority,status_id,project_id,begin_date,end_date)\
    VALUES ('task05',0,1,10,'2021-02-23','2021-03-23')")

In [13]:
#tasks=[(1,'task01',0,1,0,'2021-02-23','2021-03-23'), (2,'task02',0,1,0,'2021-02-23','2021-03-23')]
#cursor.executemany('INSERT INTO tasks VALUES (?,?,?,?,?,?,?)', tasks)

In [14]:
cursor.execute("SELECT * from tasks").fetchall()

[(1, 'task05', 0, 1, 10, '2021-02-23', '2021-03-23')]

In [15]:
cursor.execute('''CREATE TABLE EMP
             (EMPNO int, ENAME text, JOB text, MGR int, HIREDATE date, SAL real,COMM int, DEPTNO int)''')

In [16]:
data = cursor.execute("PRAGMA table_info(EMP)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 EMPNO int
1 ENAME text
2 JOB text
3 MGR int
4 HIREDATE date
5 SAL real
6 COMM int
7 DEPTNO int

In [17]:
 employes = [(7369, 'SMITH',  'CLERK', 7902, '2005-12-11', 800, 150 , 20),
 (7499, 'ALLEN',  'SALESMAN', 7698, '2006-02-23',1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698,'2006-02-26', 1250, 500, 30),
 (7566, 'JONES','MANAGER', 7839,'2006-04-02', 2975, 520, 20),            
 (7654, 'MARTIN','SALESMAN', 7698,'2006-09-28', 1400, 420, 30),
 (7698, 'BLAKE','MANAGER', 7839,'2006-05-1', 2850, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09',2450, 580,10),
 (7788, 'SCOTT', 'ANALYST', 7566,'2007-12-09',3000,640,20),
 (7839, 'KING','PRESIDENT','', '2006-11-17',5000,0,10),
 (7844, 'TURNER', 'SALESMAN',7698,'2006-09-13',1500,0,30),
 (7876, 'ADAMS', 'CLERK',7788, '2008-01-12',1100,50,20),
 (7900, 'JAMES', 'CLERK',7698, '2006-12-03',950,40,30),
 (7902, 'FORD', 'ANALYST',7566,'2006-12-03',3000,10,20),
 (7934, 'MILLER','CLERK',7782,'2007-01-23',1300,"",10)]

In [18]:
cursor.executemany('INSERT INTO EMP VALUES (?,?,?,?,?,?,?,?)', employes)

In [19]:
cursor.execute('SELECT * FROM EMP').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [ ]:
cursor.execute('''CREATE TABLE DEPT
             (DEPTNO int not null, DNAME  text, LOC text)''')

In [ ]:
depts = [(10,'ACCOUNTING','NEW YORK'),
         (20,'RESEARCH','DALLAS'),
         (30,'SALES','CHICAGO'),
         (40,'OPERATIONS','BOSTON')]

In [ ]:
type(depts)

list

In [ ]:
cursor.executemany('INSERT INTO DEPT VALUES (?,?,?)', depts)

In [ ]:
cursor.execute('SELECT * FROM DEPT').fetchall()

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [ ]:
### SELECT - Filtrando por atributos (Colunas) ##### 
cursor.execute('select empno,ename,job,sal,mgr,hiredate,comm,deptno from emp').fetchall()

[(7369, 'SMITH', 'CLERK', 800.0, 7902, '2005-12-11', 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 1600.0, 7698, '2006-02-23', 300, 30),
 (7521, 'WARD', 'SALESMAN', 1250.0, 7698, '2006-02-26', 500, 30),
 (7566, 'JONES', 'MANAGER', 2975.0, 7839, '2006-04-02', 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 1400.0, 7698, '2006-09-28', 420, 30),
 (7698, 'BLAKE', 'MANAGER', 2850.0, 7839, '2006-05-1', 600, 30),
 (7782, 'CLARK', 'MANAGER', 2450.0, 7839, '2006-06-09', 580, 10),
 (7788, 'SCOTT', 'ANALYST', 3000.0, 7566, '2007-12-09', 640, 20),
 (7839, 'KING', 'PRESIDENT', 5000.0, '', '2006-11-17', 0, 10),
 (7844, 'TURNER', 'SALESMAN', 1500.0, 7698, '2006-09-13', 0, 30),
 (7876, 'ADAMS', 'CLERK', 1100.0, 7788, '2008-01-12', 50, 20),
 (7900, 'JAMES', 'CLERK', 950.0, 7698, '2006-12-03', 40, 30),
 (7902, 'FORD', 'ANALYST', 3000.0, 7566, '2006-12-03', 10, 20),
 (7934, 'MILLER', 'CLERK', 1300.0, 7782, '2007-01-23', '', 10)]

In [20]:
### Retrieving a Subset of Rows from a Table #### 
cursor.execute('select * from emp where deptno < 30').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [21]:
cursor.execute('select count(deptno) from emp where deptno != 20').fetchall()

[(9,)]

In [22]:
cursor.execute('select DISTINCT job from emp where deptno =20').fetchall()

[('CLERK',), ('MANAGER',), ('ANALYST',)]

In [23]:
cursor.execute('select * from emp where deptno =20').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20)]

In [ ]:
cursor.execute('update emp set sal = sal*1.10 where deptno = 20')
engine.commit()
cursor.execute('select * from emp where deptno =20').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 1288.4080000000008, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 4791.267250000003, 520, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 4831.5300000000025, 640, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1771.5610000000004, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 4831.5300000000025, 10, 20)]

In [24]:
### Using Where #### 
cursor.execute('select ename, job from emp where deptno = 10').fetchall()

[('CLARK', 'MANAGER'), ('KING', 'PRESIDENT'), ('MILLER', 'CLERK')]

In [ ]:
### Using Conditional Logic in a SELECT Statement #### 
data = cursor.execute('select ename,sal, case when sal <= 2000 then "UNDERPAID"\
                when sal >= 4000 then "OVERPAID"\
                else "OK" end as status from emp').fetchall()
print("Name, Salary, Status")
for d in data: 
    print (d[0], d[1], d[2])

### case when a condição (sal <= 2000) then faz alguma ação ("Underpaid")
### when outra condição xxx then outra ação
### else executa última ação
### end fecha a clausula do case

Name, Salary, Status
SMITH 800.0 UNDERPAID
ALLEN 1600.0 UNDERPAID
WARD 1250.0 UNDERPAID
JONES 2975.0 OK
MARTIN 1400.0 UNDERPAID
BLAKE 2850.0 OK
CLARK 2450.0 OK
SCOTT 3000.0 OK
KING 5000.0 OVERPAID
TURNER 1500.0 UNDERPAID
ADAMS 1100.0 UNDERPAID
JAMES 950.0 UNDERPAID
FORD 3000.0 OK
MILLER 1300.0 UNDERPAID
SMITH 800.0 UNDERPAID
ALLEN 1600.0 UNDERPAID
WARD 1250.0 UNDERPAID
JONES 2975.0 OK
MARTIN 1400.0 UNDERPAID
BLAKE 2850.0 OK
CLARK 2450.0 OK
SCOTT 3000.0 OK
KING 5000.0 OVERPAID
TURNER 1500.0 UNDERPAID
ADAMS 1100.0 UNDERPAID
JAMES 950.0 UNDERPAID
FORD 3000.0 OK
MILLER 1300.0 UNDERPAID

In [25]:
### Limiting the Number of Rows Returned #### 
cursor.execute('select * from emp limit 5').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30)]

In [26]:
### Returning Valores aleatórios #####
cursor.execute('select ename,job from emp order by random() limit 5').fetchall()

[('KING', 'PRESIDENT'),
 ('TURNER', 'SALESMAN'),
 ('ADAMS', 'CLERK'),
 ('FORD', 'ANALYST'),
 ('SCOTT', 'ANALYST')]

In [ ]:
## Searching for Patterns ####
cursor.execute('select ename, job from emp where deptno in (10,20)').fetchall()

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('SCOTT', 'ANALYST'),
 ('KING', 'PRESIDENT'),
 ('ADAMS', 'CLERK'),
 ('FORD', 'ANALYST'),
 ('MILLER', 'CLERK')]

In [ ]:
### Searching for Patterns ###
cursor.execute('select ename, job from emp where deptno in (10,20)\
and (ename like "%I%" or job like "%ER")').fetchall()

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('MILLER', 'CLERK')]

In [ ]:
#### Order by ###
cursor.execute('select ename,job,sal from emp\
    where deptno = 10\
    order by sal asc').fetchall()

[('MILLER', 'CLERK', 1300.0),
 ('CLARK', 'MANAGER', 2450.0),
 ('KING', 'PRESIDENT', 5000.0)]

In [ ]:
#### Order By #####
cursor.execute('select empno,deptno,sal,ename,job\
    from emp\
    order by deptno, sal desc').fetchall()

[(7839, 10, 5000.0, 'KING', 'PRESIDENT'),
 (7782, 10, 2450.0, 'CLARK', 'MANAGER'),
 (7934, 10, 1300.0, 'MILLER', 'CLERK'),
 (7788, 20, 3000.0, 'SCOTT', 'ANALYST'),
 (7902, 20, 3000.0, 'FORD', 'ANALYST'),
 (7566, 20, 2975.0, 'JONES', 'MANAGER'),
 (7876, 20, 1100.0, 'ADAMS', 'CLERK'),
 (7369, 20, 800.0, 'SMITH', 'CLERK'),
 (7698, 30, 2850.0, 'BLAKE', 'MANAGER'),
 (7499, 30, 1600.0, 'ALLEN', 'SALESMAN'),
 (7844, 30, 1500.0, 'TURNER', 'SALESMAN'),
 (7654, 30, 1400.0, 'MARTIN', 'SALESMAN'),
 (7521, 30, 1250.0, 'WARD', 'SALESMAN'),
 (7900, 30, 950.0, 'JAMES', 'CLERK')]

In [ ]:
#### ORDER BY SUBSTRING ##### 
cursor.execute('select ename,job\
  from emp\
 order by substr(job,length(job)-1)').fetchall()

[('ALLEN', 'SALESMAN'),
 ('WARD', 'SALESMAN'),
 ('MARTIN', 'SALESMAN'),
 ('TURNER', 'SALESMAN'),
 ('JONES', 'MANAGER'),
 ('BLAKE', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('SMITH', 'CLERK'),
 ('ADAMS', 'CLERK'),
 ('JAMES', 'CLERK'),
 ('MILLER', 'CLERK'),
 ('SCOTT', 'ANALYST'),
 ('FORD', 'ANALYST')]

In [ ]:
cursor.execute("""
select JOB, COUNT(*) , AVG(SAL) AS "AVG_SALARY"
from EMP
group by JOB;
""").fetchall()

[('ANALYST', 2, 4831.5300000000025),
 ('CLERK', 4, 1327.4922500000002),
 ('MANAGER', 3, 3363.7557500000007),
 ('PRESIDENT', 1, 5000.0),
 ('SALESMAN', 4, 1437.5)]

In [ ]:
cursor.execute("""
select EMPNO, ENAME,JOB, SAL from EMP where SAL > (select AVG(SAL) from EMP);
""").fetchall()

[(7566, 'JONES', 'MANAGER', 4791.267250000003),
 (7698, 'BLAKE', 'MANAGER', 2850.0),
 (7788, 'SCOTT', 'ANALYST', 4831.5300000000025),
 (7839, 'KING', 'PRESIDENT', 5000.0),
 (7902, 'FORD', 'ANALYST', 4831.5300000000025)]